# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [128, 3, 2], [4, null]], # 0-P1/2
   [-1, 1, Conv, [64, 3, 1], [4, 0.5]], # 1
   [-1, 1, Conv, [64, 3, 1], [4, 0.5]], # 2
   [-1, 1, Conv, [64, 3, 1], [4, 0.5]], # 3
   [-1, 1, Conv, [288, 3, 2], [4, 0.5]], # 4-P2/4
   [-1, 1, Conv, [128, 3, 1], [4, 0.5]], # 5
   [-1, 1, Conv, [128, 3, 1], [4, 0.5]], # 6
   [[-1, 5], 1, ConvRes, [128, 128, 3, 1], [4, 0.5]],  # 7
   [-1, 1, Conv, [448, 3, 2], [4, 0.5]], # 8-P3/8
   [-1, 1, Conv, [288, 3, 1],  [4, 0.5]], # 9
   [-1, 1, Conv, [288, 3, 1],  [4, 0.5]], # 10
   [[-1, 9], 1, ConvRes, [288, 288, 3, 1], [4, 0.5]],  # 11
   [-1, 1, Conv, [768, 3, 2], [4, 0.5]], # 12-P4/16
   [-1, 1, Conv, [448, 3, 1], [4, 0.5]], # 13
   [-1, 1, Conv, [448, 3, 1], [4, 0.5]], # 14
   [[-1, 13], 1, ConvRes, [448, 448, 3, 1], [4, 0.5]],  # 15
   [-1, 1, Conv, [768, 3, 1], [4, 0.5]], # 16
   [-1, 1, Conv, [768, 3, 1], [4, 0.5]], # 17
   [[-1, 16], 1, ConvRes, [768, 768, 3, 1], [4, 0.5]],  # 18
   [-1, 1, Conv, [1280, 3, 2], [4, 0.5]], # 19-P5/32
   [-1, 1, Conv, [640, 3, 1], [4, 0.5]], # 20
  ]

head:
  [
   # P5
   [-1, 1, Conv, [640, 1, 1], [4, 0.5]], # 21
   [-1, 1, Conv, [640, 3, 1], [4, 0.5]], # 22

   # P4
   [21, 1, ConvTranspose, [320, 3, 2, 1, 1], [4, 0.5]], # 23
   [18, 1, Conv, [320, 1, 1],  [4, 0.5]], # 24
   [[-1, -2], 1, Concat, [1], null], # 25
   [-1, 1, Conv, [160, 3, 1],  [4, 0.5]], # 26

   # P3
   [-1, 1, ConvTranspose, [160, 3, 2, 1, 1], [4, 0.5]], # 27
   [11, 1, Conv, [160, 1, 1],  [4, 0.5]], # 28
   [[-1, -2], 1, Concat, [1], null], # 29
   [-1, 1, Conv, [80, 3, 1],  [4, 0.5]], # 30

   [[30, 26, 22], 1, DDetect, [nc], [4, 0.5]],  # DDetect(P3, P4, P5)
  ]
