# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [64, 3, 2], null], # 0-P1/2
   [-1, 1, Conv, [32, 3, 1], null], # 1
   [-1, 1, Conv, [32, 3, 1], null], # 2
   [-1, 1, Conv, [32, 3, 1], null], # 3
   [-1, 1, Conv, [144, 3, 2], null], # 4-P2/4
   [-1, 1, Conv, [64, 3, 1], null], # 5
   [-1, 1, Conv, [64, 3, 1], null], # 6
   [[-1, 5], 1, ConvRes, [64, 64, 3, 1], null],  # 7
   [-1, 1, Conv, [224, 3, 2], null], # 8-P3/8
   [-1, 1, Conv, [144, 3, 1],  null], # 9
   [-1, 1, Conv, [144, 3, 1],  null], # 10
   [[-1, 9], 1, ConvRes, [144, 144, 3, 1], null],  # 11
   [-1, 1, Conv, [384, 3, 2], null], # 12-P4/16
   [-1, 1, Conv, [224, 3, 1], null], # 13
   [-1, 1, Conv, [224, 3, 1], null], # 14
   [[-1, 13], 1, ConvRes, [224, 224, 3, 1], null],  # 15
   [-1, 1, Conv, [384, 3, 1], null], # 16
   [-1, 1, Conv, [384, 3, 1], null], # 17
   [[-1, 16], 1, ConvRes, [384, 384, 3, 1], null],  # 18
   [-1, 1, Conv, [640, 3, 2], null], # 19-P5/32
   [-1, 1, Conv, [320, 3, 1], null], # 20
  ]

head:
  [
   # P5
   [-1, 1, Conv, [320, 1, 1], null], # 21
   [-1, 1, Conv, [320, 3, 1], null], # 22

   # P4
   [21, 1, ConvTranspose, [160, 3, 2, 1, 1], null], # 23
   [18, 1, Conv, [160, 1, 1],  null], # 24
   [[-1, -2], 1, Concat, [1], null], # 25
   [-1, 1, Conv, [160, 3, 1],  null], # 26

   # P3
   [-1, 1, ConvTranspose, [80, 3, 2, 1, 1], null], # 27
   [11, 1, Conv, [80, 1, 1],  null], # 28
   [[-1, -2], 1, Concat, [1], null], # 29
   [-1, 1, Conv, [80, 3, 1],  null], # 30

   [[30, 26, 22], 1, DDetect, [nc], null],  # DDetect(P3, P4, P5)
  ]
